Repository: Yasinrz/torkan-reserve
Catalog: locale/*/LC_MESSAGES/django.po
Languages: fa

source: It seems you have come to the wrong page.
fa: به نظر می‌رسد شما به صفحه‌ای اشتباه منتقل شده‌اید.

source: To exit this page, refresh or press the key below to return home.
fa: برای خارج شدن از این صفحه، صفحه را بازبینی کنید یا دکمه زیر را برای برگشت به خانه بزنید.

source: home
fa: صفحه اصلی

source: Gold smelting workshop
fa: صنایع ذوب فلزات نجیب ترکان

source: 18-karat gold
fa: طلا 18 عیار

source: Melted
fa: آبشده

source: Coin
fa: سکه

source: Gram coin
fa: سکه گرمی

source: Home
fa: صفحه اصلی

source: Articles
fa: مقاله‌ها

source: Contact us
fa: ارتباط با ما

source: Torkan Separation of precious metals
fa: قالکاری ترکان

source: About us
fa: درباره ما

source: Melting and separating various precious metals with more than 20 years of experience.
fa: ذوب و جداسازی انوع فلزات گرانبها با بیش از 20 سال سابقه.

source: Address
fa: آدرس

source: Khorzoug Industrial Zone, Azadegan Boulevard, Ragbad Street, End of Ragbad 12
fa: منطقه صنعتی خورزوق،بلوار آزادگان،خیابان رگباد انتهای رگباد 12

source: Ways to contact us
fa: راه‌های ارتباط با ما

source: Telegram, Whats App and ...
fa: تلگرام، واتساپ و ...
