var calendarObject = [

[["۲۵","15","١٤",false,[],true],["۲۶","16","١٥",false,[],true],["۲۷","17","١٦",false,[],true],["۲۸","18","١٧",false,[],true],["۲۹","19","١٨",true,[],true],["۳۰","20","١٩",true,[],true],["۱","21","٢٠",true,["جشن نوروز/جشن سال نو","روز جهانی نوروز[ 21 March ]"],false],["۲","22","٢١",true,["عیدنوروز","شهادت حضرت علی علیه السلام[ ٢١ رمضان ]"],false],["۳","23","٢٢",true,["عیدنوروز","شب قدر[ ٢٢ رمضان ]","روز جهانی هواشناسی[ 23 March ]"],false],["۴","24","٢٣",true,["عیدنوروز"],false],["۵","25","٢٤",false,[],false],["۶","26","٢٥",false,["روز امید، روز شادباش نویسی","زادروز اَشو زرتشت، اَبَراِنسان بزرگ تاریخ"],false],["۷","27","٢٦",false,["روز جهانی تئاتر[ 27 March ]"],false],["۸","28","٢٧",true,[],false],["۹","29","٢٨",false,[],false],["۱۰","30","٢٩",false,["جشن آبانگاه"],false],["۱۱","31","٠١",true,["عید سعید فطر[ ١ شوال ]"],false],["۱۲","01","٠٢",true,["روز جمهوری اسلامی","تعطیل به مناسبت عید سعید فطر[ ٢ شوال ]"],false],["۱۳","02","٠٣",true,["جشن سیزده به در"],false],["۱۴","03","٠٤",false,[],false],["۱۵","04","٠٥",true,[],false],["۱۶","05","٠٦",false,[],false],["۱۷","06","٠٧",false,["سروش روز،جشن سروشگان"],false],["۱۸","07","٠٨",false,["روز جهانی بهداشت[ 7 April ]"],false],["۱۹","08","٠٩",false,["فروردین روز،جشن فروردینگان"],false],["۲۰","09","١٠",false,[],false],["۲۱","10","١١",false,[],false],["۲۲","11","١٢",true,[],false],["۲۳","12","١٣",false,["روز دندانپزشک"],false],["۲۴","13","١٤",false,[],false],["۲۵","14","١٥",false,["روز بزرگداشت عطار نیشابوری"],false],["۲۶","15","١٦",false,[],false],["۲۷","16","١٧",false,[],false],["۲۸","17","١٨",false,[],false],["۲۹","18","١٩",true,["روز ارتش جمهوری اسلامی ایران"],false],["۳۰","19","٢٠",false,["روز علوم آزمایشگاهی، زاد روز حکیم سید اسماعیل جرجانی"],false],["۳۱","20","٢١",false,[],false],["۱","21","٢٢",false,[],true],["۲","22","٢٣",false,[],true],["۳","23","٢٤",false,[],true],["۴","24","٢٥",true,[],true],["۵","25","٢٦",true,[],true]],

[["۳۰","19","٢٠",false,[],true],["۳۱","20","٢١",false,[],true],["۱","21","٢٢",false,["روز بزرگداشت سعدی"],false],["۲","22","٢٣",false,["جشن گیاه آوری؛ روز زمین[ 22 April ]"],false],["۳","23","٢٤",false,["روزبزرگداشت شیخ بهایی؛ روزملی کارآفرینی؛ روز معماری"],false],["۴","24","٢٥",true,["شهادت امام جعفر صادق علیه السلام[ ٢٥ شوال ]"],false],["۵","25","٢٦",true,[],false],["۶","26","٢٧",false,[],false],["۷","27","٢٨",false,["روز جهانی طراحی و گرافیک[ 27 April ]"],false],["۸","28","٢٩",false,[],false],["۹","29","٠١",false,["ولادت حضرت معصومه سلام الله علیها و روز دختران[ ١ ذوالقعده ]","روز ملی روانشناس و مشاور"],false],["۱۰","30","٠٢",false,["جشن چهلم نوروز؛ روز ملی خلیج فارس"],false],["۱۱","01","٠٣",false,["روزجهانیکارگر[ 1 May ]"],false],["۱۲","02","٠٤",true,["روز معلم"],false],["۱۳","03","٠٥",false,[],false],["۱۴","04","٠٦",false,[],false],["۱۵","05","٠٧",false,["جشن میانه بهار/جشن بهاربد؛ روز شیراز","روز جهانی ماما[ 5 May ]"],false],["۱۶","06","٠٨",false,[],false],["۱۷","07","٠٩",false,[],false],["۱۸","08","١٠",false,["روز جهانی صلیب سرخ و هلال احمر[ 8 May ]"],false],["۱۹","09","١١",true,["ولادت امامرضا علیه السلام[ ١١ ذوالقعده ]"],false],["۲۰","10","١٢",false,[],false],["۲۱","11","١٣",false,[],false],["۲۲","12","١٤",false,["زادروز مریم میرزاخانی ریاضیدان ایرانی، روز جهانی زن در ریاضیات","روز جهانی پرستار[ 12 May ]"],false],["۲۳","13","١٥",false,[],false],["۲۴","14","١٦",false,[],false],["۲۵","15","١٧",false,["روز بزرگداشت فردوسی"],false],["۲۶","16","١٨",true,[],false],["۲۷","17","١٩",false,["روز ارتباطات و روابط عمومی"],false],["۲۸","18","٢٠",false,["روز بزرگداشت حکیم عمر خیام","روز جهانی موزه و میراث فرهنگی[ 18 May ]"],false],["۲۹","19","٢١",false,[],false],["۳۰","20","٢٢",false,[],false],["۳۱","21","٢٣",false,[],false],["۱","22","٢٤",false,[],true],["۲","23","٢٥",true,[],true]],

[["۲۷","17","١٩",false,[],true],["۲۸","18","٢٠",false,[],true],["۲۹","19","٢١",false,[],true],["۳۰","20","٢٢",false,[],true],["۳۱","21","٢٣",false,[],true],["۱","22","٢٤",false,["روز بهره وری و بهینه سازی مصرف","روز بزرگداشت ملاصدرا"],false],["۲","23","٢٥",true,["فروریختن ساختمان متروپل در آبادان"],false],["۳","24","٢٦",false,["فتح خرمشهر در عملیات بیت المقدس و روز مقاومت، ایثار و پیروزی"],false],["۴","25","٢٧",false,["روز دزفول، روز مقاومت و پایداری"],false],["۵","26","٢٨",false,[],false],["۶","27","٢٩",false,["خرداد روز،جشن خردادگان","شهادت امام محمد تقی علیه السلام[ ٢٩ ذوالقعده ]"],false],["۷","28","٠١",false,[],false],["۸","29","٠٢",false,[],false],["۹","30","٠٣",true,[],false],["۱۰","31","٠٤",false,["روز جهانی بدون دخانیات[ 31 May ]"],false],["۱۱","01","٠٥",false,[],false],["۱۲","02","٠٦",false,[],false],["۱۳","03","٠٧",false,["شهادت امام محمد باقر علیه السلام[ ٧ ذوالحجه ]"],false],["۱۴","04","٠٨",true,["رحلت حضرت امام خمینی"],false],["۱۵","05","٠٩",true,["قیام 15 خرداد","روز جهانی محیط زیست[ 5 June ]","روز عرفه[ ٩ ذوالحجه ]"],false],["۱۶","06","١٠",true,["عید سعید قربان[ ١٠ ذوالحجه ]"],false],["۱۷","07","١١",false,[],false],["۱۸","08","١٢",false,[],false],["۱۹","09","١٣",false,[],false],["۲۰","10","١٤",false,["روز جهانی صنایع دستی[ 10 June ]"],false],["۲۱","11","١٥",false,["ولادت امام علی النقی الهادی علیه السلام[ ١٥ ذوالحجه ]"],false],["۲۲","12","١٦",false,["روز جهانی مبارزه با کار کودکان[ 12 June ]"],false],["۲۳","13","١٧",true,[],false],["۲۴","14","١٨",true,["عید سعید غدیر خم[ ١٨ ذوالحجه ]","روز جهانی اهدای خون[ 14 June ]"],false],["۲۵","15","١٩",false,["روز ملی گل وگیاه"],false],["۲۶","16","٢٠",false,["ولادت امام موسی کاظم علیه السلام[ ٢٠ ذوالحجه ]","روز جهانی پدر[ 16 June ]"],false],["۲۷","17","٢١",false,["روز جهانی بیابان زدایی[ 17 June ]"],false],["۲۸","18","٢٢",false,[],false],["۲۹","19","٢٣",false,[],false],["۳۰","20","٢٤",true,[],false],["۳۱","21","٢٥",false,["سالروز زلزله رودبار و منجیل [1369خورشیدی]"],false],["۱","22","٢٦",false,[],true],["۲","23","٢٧",false,[],true],["۳","24","٢٨",false,[],true],["۴","25","٢٩",false,[],true],["۵","26","٣٠",false,[],true],["۶","27","٠١",true,[],true]],

[["۳۱","21","٢٥",false,[],true],["۱","22","٢٦",false,["جشن آب پاشونک، جشن آغاز تابستان"],false],["۲","23","٢٧",false,[],false],["۳","24","٢٨",false,[],false],["۴","25","٢٩",false,[],false],["۵","26","٣٠",false,["روز جهانی مبارزه با مواد مخدر[ 26 June ]"],false],["۶","27","٠١",true,[],false],["۷","28","٠٢",false,["انفجار دفتر حزب جمهوری اسلامی و شهادت دکتر بهشتی و 72 نفر از اعضای حزب؛ روز قوه قضاییه"],false],["۸","29","٠٣",false,["روز مبارزه با سلاح های شیمیایی و میکروبی"],false],["۹","30","٠٤",false,[],false],["۱۰","01","٠٥",false,["روز صنعت و معدن","زادروز بابک خرمدین، سپه‌سالار دلاور ایران","روز بزرگداشت صائب تبریزی"],false],["۱۱","02","٠٦",false,[],false],["۱۲","03","٠٧",false,["شلیک به پرواز 655 ایران ایر توسط ناو وینسنس [ 1367 خورشیدی ]"],false],["۱۳","04","٠٨",true,["جشن تیرگان، بزرگداشت کمان کشیدن جان‌فدای ایران، آرش کمانگیر بر فراز البرز"],false],["۱۴","05","٠٩",true,["روز قلم","تاسوعای حسینی[ ٩ محرم ]"],false],["۱۵","06","١٠",true,["جشن خام خواری","عاشورای حسینی[ ١٠ محرم ]"],false],["۱۶","07","١١",false,[],false],["۱۷","08","١٢",false,["شهادتامام زین العابدین علیه السلام[ ١٢ محرم ]"],false],["۱۸","09","١٣",false,[],false],["۱۹","10","١٤",false,[],false],["۲۰","11","١٥",true,[],false],["۲۱","12","١٦",false,[],false],["۲۲","13","١٧",false,["زادروز محمد خوارزمی، ریاضیدان و فیلسوف ایرانی و روز ملی فناوری اطلاعات"],false],["۲۳","14","١٨",false,[],false],["۲۴","15","١٩",false,[],false],["۲۵","16","٢٠",false,["روز بهزیستی و تامین اجتماعی"],false],["۲۶","17","٢١",false,[],false],["۲۷","18","٢٢",true,["اعلام پذیرش قطعنامه 598 شورای امنیت از سوی ایران [ 1367 خورشیدی ]"],false],["۲۸","19","٢٣",false,[],false],["۲۹","20","٢٤",false,[],false],["۳۰","21","٢٥",false,[],false],["۳۱","22","٢٦",false,[],false],["۱","23","٢٧",false,[],true],["۲","24","٢٨",false,[],true],["۳","25","٢٩",true,[],true]],

[["۲۸","19","٢٣",false,[],true],["۲۹","20","٢٤",false,[],true],["۳۰","21","٢٥",false,[],true],["۳۱","22","٢٦",false,[],true],["۱","23","٢٧",false,[],false],["۲","24","٢٨",false,[],false],["۳","25","٢٩",true,[],false],["۴","26","٠١",false,[],false],["۵","27","٠٢",false,[],false],["۶","28","٠٣",false,[],false],["۷","29","٠٤",false,["اَمرداد روز،جشناَمردادگان"],false],["۸","30","٠٥",false,["روز بزرگداشت شیخ شهاب الدین سهروردی"],false],["۹","31","٠٦",false,[],false],["۱۰","01","٠٧",true,["جشن چله تابستان","آغاز هفته جهانی شیردهی[ 1 August ]"],false],["۱۱","02","٠٨",false,[],false],["۱۲","03","٠٩",false,[],false],["۱۳","04","١٠",false,[],false],["۱۴","05","١١",false,["سالروز صدور فرمان مشروطیت"],false],["۱۵","06","١٢",false,[],false],["۱۶","07","١٣",false,[],false],["۱۷","08","١٤",true,["روز خبرنگار"],false],["۱۸","09","١٥",false,[],false],["۱۹","10","١٦",false,[],false],["۲۰","11","١٧",false,[],false],["۲۱","12","١٨",false,[],false],["۲۲","13","١٩",false,["روز جهانی چپ دست ها[ 13 August ]"],false],["۲۳","14","٢٠",true,["اربعین حسینی[ ٢٠ صفر ]"],false],["۲۴","15","٢١",true,[],false],["۲۵","16","٢٢",false,[],false],["۲۶","17","٢٣",false,[],false],["۲۷","18","٢٤",false,[],false],["۲۸","19","٢٥",false,["سالروز وقایع 28 مرداد پس از برکناری محمد مصدق‌السلطنه","سالروز فاجعه آتش زدن سینما رکس آبادان","روز جهانی عکاسی[ 19 August ]"],false],["۲۹","20","٢٦",false,[],false],["۳۰","21","٢٧",false,[],false],["۳۱","22","٢٨",true,["رحلترسول اکرم؛شهادت امام حسن مجتبی علیه السلام[ ٢٨ صفر ]"],false]],

[["۱","23","٢٩",false,["روز بزرگداشت ابوعلی سینا و روز پزشک"],false],["۲","24","٣٠",true,["آغاز هفته دولت","شهادت امام رضا علیه السلام[ ٣٠ صفر ]"],false],["۳","25","٠١",false,["هجرت پیامبر اکرم از مکه به مدینه[ ١ ربيع الاول ]"],false],["۴","26","٠٢",false,["زادروز کوروش بزرگ","شهریور روز،جشن شهریورگان"],false],["۵","27","٠٣",false,["روز بزرگداشت محمدبن زکریای رازی و روز داروساز"],false],["۶","28","٠٤",false,[],false],["۷","29","٠٥",true,[],false],["۸","30","٠٦",false,["انفجار در دفتر نخست‌وزیری جمهوری اسلامی ایران، روز مبارزه با تروریسم"],false],["۹","31","٠٧",false,[],false],["۱۰","01","٠٨",true,["شهادت امام حسن عسکری علیه السلام[ ٨ ربيع الاول ]"],false],["۱۱","02","٠٩",false,["روزصنعت چاپ"],false],["۱۲","03","١٠",false,["سالروز شهادت رئیسعلی دلواری، سردار بزرگ میهن و فرمانده قیام جنوب علیه اشغالگران انگلیسی"],false],["۱۳","04","١١",false,["روز بزرگداشت ابوریحان بیرونی"],false],["۱۴","05","١٢",true,["میلاد رسول اکرم به روایت اهل سنت[ ١٢ ربيع الاول ]"],false],["۱۵","06","١٣",false,[],false],["۱۶","07","١٤",false,[],false],["۱۷","08","١٥",false,[],false],["۱۸","09","١٦",false,[],false],["۱۹","10","١٧",true,["میلاد رسول اکرم و امام جعفر صادق علیه السلام[ ١٧ ربيع الاول ]","روز جهانی پیشگیری از خودکشی[ 10 September ]"],false],["۲۰","11","١٨",false,["حمله به برج‌های دوقلوی مرکز تجارت جهانی[ 11 September ]"],false],["۲۱","12","١٩",true,["روز سینما"],false],["۲۲","13","٢٠",false,[],false],["۲۳","14","٢١",false,[],false],["۲۴","15","٢٢",false,[],false],["۲۵","16","٢٣",false,[],false],["۲۶","17","٢٤",false,[],false],["۲۷","18","٢٥",false,["روز شعر و ادب پارسی وروز بزرگداشت استاد شهریار"],false],["۲۸","19","٢٦",true,[],false],["۲۹","20","٢٧",false,[],false],["۳۰","21","٢٨",false,["روز جهانی صلح[ 21 September ]"],false],["۳۱","22","٢٩",false,["آغاز هفته دفاع مقدس"],false],["۱","23","٣٠",false,[],true],["۲","24","٠١",false,[],true],["۳","25","٠٢",false,[],true],["۴","26","٠٣",true,[],true]],

[["۲۹","20","٢٧",false,[],true],["۳۰","21","٢٨",false,[],true],["۳۱","22","٢٩",false,[],true],["۱","23","٣٠",false,["آغاز حمله مغول به ایران در پاییز 598 خورشیدی"],false],["۲","24","٠١",false,[],false],["۳","25","٠٢",false,[],false],["۴","26","٠٣",true,["روز گرامیداشت سربازان وطن"],false],["۵","27","٠٤",false,["روز جهانی جهانگردی[ 27 September ]"],false],["۶","28","٠٥",false,[],false],["۷","29","٠٦",false,["روز آتش نشانی و ایمنی","سقوط هواپیمای حامل جمعی از فرماندهان جنگ (کلاهدوز، نامجو، فلاحی، فکوری، جهان آرا) در سال 1360","روز بزرگداشت شمس تبریزی"],false],["۸","30","٠٧",false,["روزبزرگداشت مولوی","روز جهانی ناشنوایان[ 30 September ]","روز جهانی ترجمه و مترجم[ 30 September ]"],false],["۹","01","٠٨",false,["ولادت امام حسن عسکری علیه السلام[ ٨ ربيع الثاني ]","روز جهانی سالمندان[ 1 October ]"],false],["۱۰","02","٠٩",false,["مهر روز،جشن مهرگان"],false],["۱۱","03","١٠",true,["وفات حضرت معصومه سلام الله علیها[ ١٠ ربيع الثاني ]"],false],["۱۲","04","١١",false,["آغاز هفته جهانی فضا[ 4 October ]"],false],["۱۳","05","١٢",false,["روز جهانی معلم[ 5 October ]"],false],["۱۴","06","١٣",false,["روز دامپزشکی"],false],["۱۵","07","١٤",false,[],false],["۱۶","08","١٥",false,["روز ملی کودک"],false],["۱۷","09","١٦",false,["روز جهانی پست[ 9 October ]"],false],["۱۸","10","١٧",true,["روز جهانی مبارزه با حکم اعدام[ 10 October ]"],false],["۱۹","11","١٨",false,["روز جهانی دختر[ 11 October ]"],false],["۲۰","12","١٩",false,["روز بزرگداشت حافظ"],false],["۲۱","13","٢٠",false,["روز پیروزی کاوه و فریدون بر ضحاک"],false],["۲۲","14","٢١",false,["روز جهانی استاندارد[ 14 October ]"],false],["۲۳","15","٢٢",false,["روز جهانی عصای سفید[ 15 October ]"],false],["۲۴","16","٢٣",false,["روز جهانی غذا[ 16 October ]"],false],["۲۵","17","٢٤",true,["روز جهانی ریشه کنی فقر[ 17 October ]"],false],["۲۶","18","٢٥",false,["روز تربیت بدنی و ورزش"],false],["۲۷","19","٢٦",false,[],false],["۲۸","20","٢٧",false,["زادروز ستارخان ملقب به سردار ملی و از سرداران جنبش مشروطه ایران"],false],["۲۹","21","٢٨",false,["روز ملی کوهنورد"],false],["۳۰","22","٢٩",false,[],false],["۱","23","٠١",false,[],true],["۲","24","٠٢",true,[],true]],

[["۲۶","18","٢٥",false,[],true],["۲۷","19","٢٦",false,[],true],["۲۸","20","٢٧",false,[],true],["۲۹","21","٢٨",false,[],true],["۳۰","22","٢٩",false,[],true],["۱","23","٠١",false,["روز آمار و برنامه ریزی","روز بزرگداشت ابوالفضل بیهقی، تاریخ‌نگار و نویسنده ایرانی"],false],["۲","24","٠٢",true,[],false],["۳","25","٠٣",false,[],false],["۴","26","٠٤",false,[],false],["۵","27","٠٥",false,["ولادت حضرت زینب سلام الله علیها و روز پرستار و بهورز[ ٥ جمادي الاولي ]"],false],["۶","28","٠٦",false,[],false],["۷","29","٠٧",false,["سالروز ورود کوروش بزرگ به بابل در سال 539 پیش از میلاد"],false],["۸","30","٠٨",false,[],false],["۹","31","٠٩",true,[],false],["۱۰","01","١٠",false,["آبان روز، جشن آبانگان"],false],["۱۱","02","١١",false,[],false],["۱۲","03","١٢",false,[],false],["۱۳","04","١٣",false,["روز دانش آموز"],false],["۱۴","05","١٤",false,["روز ملّی مازندران"],false],["۱۵","06","١٥",false,["جشن میانه پاییز"],false],["۱۶","07","١٦",true,[],false],["۱۷","08","١٧",false,[],false],["۱۸","09","١٨",false,["روز ملی کیفیت"],false],["۱۹","10","١٩",false,[],false],["۲۰","11","٢٠",false,[],false],["۲۱","12","٢١",false,[],false],["۲۲","13","٢٢",false,[],false],["۲۳","14","٢٣",true,["روز جهانی دیابت[ 14 November ]"],false],["۲۴","15","٢٤",false,["روز کتاب و کتابخوانی"],false],["۲۵","16","٢٥",false,[],false],["۲۶","17","٢٦",false,[],false],["۲۷","18","٢٧",false,[],false],["۲۸","19","٢٨",false,["روز جهانی آقایان[ 19 November ]"],false],["۲۹","20","٢٩",false,["روز جهانی کودک[ 20 November ]"],false],["۳۰","21","٣٠",true,[],false]],

[["۱","22","٠١",false,["آذر جشن"],false],["۲","23","٠٢",false,[],false],["۳","24","٠٣",true,["شهادت حضرت فاطمه زهرا سلام الله علیها[ ٣ جمادي الثانيه ]"],false],["۴","25","٠٤",false,["روز جهانی مبارزه با خشونت علیه زنان[ 25 November ]"],false],["۵","26","٠٥",false,["روز بسیج مستضعفان"],false],["۶","27","٠٦",false,[],false],["۷","28","٠٧",true,["سالروز عملیات مروارید و روز نیروی دریایی"],false],["۸","29","٠٨",false,[],false],["۹","30","٠٩",false,["جشن آذرگان ،آذر روز"],false],["۱۰","01","١٠",false,["روز جهانی ایدز[ 1 December ]"],false],["۱۱","02","١١",false,[],false],["۱۲","03","١٢",false,["روز جهانی معلولان[ 3 December ]"],false],["۱۳","04","١٣",false,["روز بیمه"],false],["۱۴","05","١٤",true,[],false],["۱۵","06","١٥",false,["روز حسابدار"],false],["۱۶","07","١٦",false,["روز دانشجو"],false],["۱۷","08","١٧",false,[],false],["۱۸","09","١٨",false,[],false],["۱۹","10","١٩",false,["روز جهانی حقوق بشر[ 10 December ]"],false],["۲۰","11","٢٠",false,["ولادت حضرت فاطمه زهرا سلام الله علیها و روز مادر[ ٢٠ جمادي الثانيه ]","روز جهانی کوهستان[ 11 December ]"],false],["۲۱","12","٢١",true,["سالروز نجات آذربایجان"],false],["۲۲","13","٢٢",false,[],false],["۲۳","14","٢٣",false,[],false],["۲۴","15","٢٤",false,[],false],["۲۵","16","٢٥",false,["روز پژوهش و فنآوری"],false],["۲۶","17","٢٦",false,[],false],["۲۷","18","٢٧",false,[],false],["۲۸","19","٢٨",true,[],false],["۲۹","20","٢٩",false,[],false],["۳۰","21","٣٠",false,["جشن شب یلدا، شب چلّه"],false],["۱","22","٠١",false,[],true],["۲","23","٠٢",false,[],true],["۳","24","٠٣",false,[],true],["۴","25","٠٤",false,[],true],["۵","26","٠٥",true,[],true]],

[["۲۹","20","٢٩",false,[],true],["۳۰","21","٣٠",false,[],true],["۱","22","٠١",false,["روز میلاد خورشید؛ جشن خرم روز، نخستین جشن دیگان","ولادتامام محمد باقر علیه السلام[ ١ رجب ]"],false],["۲","23","٠٢",false,[],false],["۳","24","٠٣",false,["شهادت امام علی النقی الهادی علیه السلام[ ٣ رجب ]"],false],["۴","25","٠٤",false,["جشن کریسمس[ 25 December ]","روز بزرگداشت دوستی[ 25 December ]"],false],["۵","26","٠٥",true,["زمین لرزه ی بم [1382 خورشیدی]","سالروز شهادت اَشو زرتشت، اَبَراِنسان بزرگ تاریخ","سالروز عملیات کربلای 4 [1365 خورشیدی]"],false],["۶","27","٠٦",false,[],false],["۷","28","٠٧",false,[],false],["۸","29","٠٨",false,["دی به آذر روز، دومین جشن دیگان","روز بزرگداشت یعقوب لیث صفاری (رادمان پورماهک) نخستین پادشاه ایرانی پس از اسلام"],false],["۹","30","٠٩",false,["اعدام میهن‌پرستان آذری در تبریز توسط قوای اشغالگر روس [1290 خورشیدی]"],false],["۱۰","31","١٠",false,["ولادت امام محمد تقی علیه السلام[ ١٠ رجب ]"],false],["۱۱","01","١١",false,["جشن آغاز سال نو میلادی[ 1 January ]"],false],["۱۲","02","١٢",true,[],false],["۱۳","03","١٣",true,["ولادت امام علی علیه السلام و روز پدر[ ١٣ رجب ]","شهادت سردار حاج قاسم سلیمانی [1398 خورشیدی]"],false],["۱۴","04","١٤",false,[],false],["۱۵","05","١٥",false,["دی به مهر روز، سومین جشن دیگان","وفات حضرت زینب سلام الله علیها[ ١٥ رجب ]"],false],["۱۶","06","١٦",false,["غرق شدن کشتی سانچی [1396 خورشیدی]"],false],["۱۷","07","١٧",false,[],false],["۱۸","08","١٨",false,["شلیک به پرواز 752 هواپیمایی اوکراین [1398 خورشیدی]"],false],["۱۹","09","١٩",true,["درگذشت اکبر هاشمی رفسنجانی [1395 خورشیدی]"],false],["۲۰","10","٢٠",false,["قتل امیرکبیر به دستور ناصرالدین شاه قاجار [1230 خورشیدی]"],false],["۲۱","11","٢١",false,[],false],["۲۲","12","٢٢",false,[],false],["۲۳","13","٢٣",false,["دی به دین روز، چهارمین جشن دیگان"],false],["۲۴","14","٢٤",false,[],false],["۲۵","15","٢٥",false,["شهادت امام موسی کاظم علیه السلام[ ٢٥ رجب ]"],false],["۲۶","16","٢٦",true,[],false],["۲۷","17","٢٧",true,["مبعث رسول اکرم (ص)[ ٢٧ رجب ]"],false],["۲۸","18","٢٨",false,[],false],["۲۹","19","٢٩",false,[],false],["۳۰","20","٣٠",false,["آتش‌سوزی و فروریختن ساختمان پلاسکو [1395 خورشیدی]"],false],["۱","21","٠١",false,[],true],["۲","22","٠٢",false,[],true],["۳","23","٠٣",true,[],true]],

[["۲۷","17","٢٧",true,[],true],["۲۸","18","٢٨",false,[],true],["۲۹","19","٢٩",false,[],true],["۳۰","20","٣٠",false,[],true],["۱","21","٠١",false,["زادروز فردوسی"],false],["۲","22","٠٢",false,["بهمن روز، جشن بهمنگان"],false],["۳","23","٠٣",true,["ولادت سالار شهیدان، امام حسین علیه السلام و روز پاسدار[ ٣ شعبان ]"],false],["۴","24","٠٤",false,["ولادت ابوالفضل العباس علیه السلام و روز جانباز[ ٤ شعبان ]"],false],["۵","25","٠٥",false,["جشن نوسره","ولادت امام زین العابدین علیه السلام[ ٥ شعبان ]"],false],["۶","26","٠٦",false,["بزرگداشت صفی‌الدین اُرمَوی و روز موسیقی ایرانی"],false],["۷","27","٠٧",false,[],false],["۸","28","٠٨",false,[],false],["۹","29","٠٩",false,[],false],["۱۰","30","١٠",true,["جشن سده، گرامیداشتِ کشف آتش به دستِ هوشنگ شاه"],false],["۱۱","31","١١",false,["ولادت علی اکبر علیه السلام و روز جوان[ ١١ شعبان ]"],false],["۱۲","01","١٢",false,["بازگشت امام خمینی (ره) به ایران"],false],["۱۳","02","١٣",false,[],false],["۱۴","03","١٤",false,[],false],["۱۵","04","١٥",true,["جشن میانه زمستان","ولادت حضرت قائم عجل الله تعالی فرجه و جشن نیمه شعبان[ ١٥ شعبان ]"],false],["۱۶","05","١٦",false,[],false],["۱۷","06","١٧",true,[],false],["۱۸","07","١٨",false,[],false],["۱۹","08","١٩",false,["روز نیروی هوایی"],false],["۲۰","09","٢٠",false,[],false],["۲۱","10","٢١",false,[],false],["۲۲","11","٢٢",true,["پیروزی انقلاب اسلامی","حمله به سفارت روسیه و قتل گریبایدوف سفیر روسیه تزاری در ایران[ 11 February ]"],false],["۲۳","12","٢٣",false,[],false],["۲۴","13","٢٤",true,[],false],["۲۵","14","٢٥",false,["جشن ولنتاین[ 14 February ]"],false],["۲۶","15","٢٦",false,[],false],["۲۷","16","٢٧",false,[],false],["۲۸","17","٢٨",false,[],false],["۲۹","18","٢٩",false,["جشن سپندارمذگان و روز عشق","فاجعه انفجار قطار نیشابور [1382 خورشیدی]"],false],["۳۰","19","٠١",false,[],false],["۱","20","٠٢",true,[],true]],

[["۲۵","14","٢٥",false,[],true],["۲۶","15","٢٦",false,[],true],["۲۷","16","٢٧",false,[],true],["۲۸","17","٢٨",false,[],true],["۲۹","18","٢٩",false,[],true],["۳۰","19","٠١",false,[],true],["۱","20","٠٢",true,[],false],["۲","21","٠٣",false,[],false],["۳","22","٠٤",false,[],false],["۴","23","٠٥",false,[],false],["۵","24","٠٦",false,["جشن سپندارمذگان و روز عشق","روز بزرگداشت خواجه نصیر الدین طوسی و روز مهندس"],false],["۶","25","٠٧",false,[],false],["۷","26","٠٨",false,["سالروز استقلال کانون وکلای دادگستری و روز وکیل مدافع"],false],["۸","27","٠٩",true,[],false],["۹","28","١٠",false,[],false],["۱۰","01","١١",false,[],false],["۱۱","02","١٢",false,[],false],["۱۲","03","١٣",false,[],false],["۱۳","04","١٤",false,[],false],["۱۴","05","١٥",false,["ولادت امام حسن مجتبی علیه السلام[ ١٥ رمضان ]"],false],["۱۵","06","١٦",true,["روز درختکاری"],false],["۱۶","07","١٧",false,[],false],["۱۷","08","١٨",false,["شب قدر[ ١٨ رمضان ]","روزجهانی زنان[ 8 March ]"],false],["۱۸","09","١٩",false,["ضربت خوردن حضرت علی علیه السلام[ ١٩ رمضان ]"],false],["۱۹","10","٢٠",false,[],false],["۲۰","11","٢١",true,["شهادت حضرت علی علیه السلام[ ٢١ رمضان ]"],false],["۲۱","12","٢٢",false,["شب قدر[ ٢٢ رمضان ]"],false],["۲۲","13","٢٣",true,[],false],["۲۳","14","٢٤",false,["روز جهانی عدد پیπ[ 14 March ]"],false],["۲۴","15","٢٥",false,[],false],["۲۵","16","٢٦",false,["پایان سرایش شاهنامه","روز بزرگداشت اختر چرخ ادب، پروین اعتصامی"],false],["۲۶","17","٢٧",false,[],false],["۲۷","18","٢٨",false,[],false],["۲۸","19","٢٩",false,[],false],["۲۹","20","٣٠",true,["روز ملی شدن صنعت نفت ایران","روز جهانی شادی[ 20 March ]"],false]],  

];

const metaYear = {
    year: 1404,
    metaYear: [
        "March - April 2025 | رمضان - شوال - ١٤٤٦",
        "April - May 2025 | شوال - ذوالقعده - ١٤٤٦",
        "May - June 2025 | ذوالقعده - ذوالحجه - ١٤٤٦",
        "June - July 2025 | ذوالحجه - محرم - ١٤٤٦",
        "July - August 2025 | محرم - صفر - ١٤٤٧",
        "August - September 2025 | صفر - ربيع الاول - ١٤٤٧",
        "September - October 2025 | ربيع الاول - ربيع الثاني - ١٤٤٧",
        "October - November 2025 | جمادي الاولي - ١٤٤٧",
        "November - December 2025 | جمادي الثانيه - ١٤٤٧",
        "December 2025 - January 2026 | رجب - ١٤٤٧",
        "January - February 2026 | شعبان - رمضان - ١٤٤٧",
        "February - March 2026 | رمضان - ١٤٤٧",
    ]
}

const cssProperty = {

    "spring": [
        {
            selector: ".num-dates ul li:hover, .num-dates ul li:hover",
            property: [
                "background-color: #5e991a;",
                "color: white;",
            ]
        },

        {
            selector: ".active-season",
            property: [
                "background-color: #5e991a !important;",
                "color:white !important;",
            ]
        },

        {
            selector: ".active-season-cr, .month-hover:hover",
            property: [
                "color: #5e991a !important;"
            ]
        },

        {
            selector: ".holiday:hover, .active-season-bg",
            property: [
                "background-color: #5e991a !important;",
            ]
        },

        {
            selector: ".year-meta, .year",
            property: [
                "color: #5e991a;",
            ]
        }
    ],

    "summer": [
        {
            selector: ".num-dates ul li:hover, .num-dates ul li:hover",
            property: [
                "background-color: #4caf50 ;",
                "color: white;",
            ]
        },

        {
            selector: ".active-season",
            property: [
                "background-color: #4caf50  !important;",
                "color:white !important;",
            ]
        },

        {
            selector: ".active-season-cr, .month-hover:hover",
            property: [
                "color: #4caf50  !important;"
            ]
        },

        {
            selector: ".holiday:hover, .active-season-bg",
            property: [
                "background-color: #4caf50  !important;",
            ]
        },

        {
            selector: ".year-meta, .year",
            property: [
                "color: #4caf50 ;",
            ]
        }
    ],

    "fall": [
        {
            selector: ".num-dates ul li:hover, .num-dates ul li:hover",
            property: [
                "background-color: #ff9800;",
                "color: white;",
            ]
        },

        {
            selector: ".active-season",
            property: [
                "background-color: #ff9800 !important;",
                "color:white !important;",
            ]
        },

        {
            selector: ".active-season-cr, .month-hover:hover",
            property: [
                "color: #ff9800 !important;"
            ]
        },

        {
            selector: ".holiday:hover, .active-season-bg",
            property: [
                "background-color: #ff9800 !important;",
            ]
        },

        {
            selector: ".year-meta, .year",
            property: [
                "color: #ff9800;",
            ]
        }
    ],

    "winter": [
        {
            selector: ".num-dates ul li:hover, .num-dates ul li:hover",
            property: [
                "background-color: #0984e3;",
                "color: white;",
            ]
        },

        {
            selector: ".active-season",
            property: [
                "background-color: #0984e3 !important;",
                "color:white !important;",
            ]
        },

        {
            selector: ".active-season-cr, .month-hover:hover",
            property: [
                "color: #0984e3 !important;"
            ]
        },

        {
            selector: ".holiday:hover, .active-season-bg",
            property: [
                "background-color: #0984e3 !important;",
            ]
        },

        {
            selector: ".year-meta, .year",
            property: [
                "color: #0984e3;",
            ]
        }
    ]
};