Repository: Yasinrz/torkan-reserve
Catalog: accounts/locale/*/LC_MESSAGES/django.po
Languages: fa

source: datetime joined
fa: تاریخ عضویت

source: Password
fa: رمز عبور

source: Confirm password
fa: تکرار گذرواژه

source: phone number
fa: شماره همراه

source: First and last name
fa: نام و نام خانوادگی

source: is active ?
fa: فعال است؟

source: is staff ?
fa: کارمند است؟

source: is superuser ?
fa: ادمین است؟

source: date joined
fa: تاریخ عضویت

source: Enter your phone number to book an appointment.
fa: شماره تلفن خود را وارد کنید.

source: Get validation code
fa: دریافت کد اعتبار سنجی

source: Phone number verification
fa: تأیید شماره تلفن

source: Please enter the 4-digit code sent to your number.
fa: لطفا کد ۴ رقمی ارسال شده به شماره خود را وارد کنید

source: verification
fa: تایید کد

source: Didn't receive a code?
fa: کدی دریافت نکردید؟

source: Resend
fa: ارسال مجدد

source: Your appointment has been temporarily booked.
fa: نوبت شما به صورت موقت ثبت گردید

source: We will contact you soon to arrange a definitive reservation.
fa: به زودی جهت زمان قطعی نوبت از طریق تماس یا پیامک به شما اطلاع رسانی خواهد شد.

source: Thank you for your patience.
fa: از شکیبایی شما سپاسگزاریم

source: return home
fa: بازگشت به خانه
