Repository: Yasinrz/torkan-reserve
Catalog: home/locale/*/LC_MESSAGES/django.po
Languages: fa

source: Reservation date
fa: تاریخ رزرو

source: Request reservation date
fa: درخواست رزرو نوبت

source: datetime saved
fa: تاریخ ایجاد

source: suggested_reservation_date
fa: تاریخ پیشنهادی نوبت

source: datetime_created
fa: تاریخ ایجاد

source: Requested Data Reservation
fa: تاریخ پیشنهادی نوبت

source: you can't reserve in the past
fa: روز‌های گذشته قابل رزرو نمی‌باشد.

source: you can reserve only for the next 14 days
fa: تا دو هفته بعد قابل رزرو می‌باشد.

source: you can't reserve on Friday
fa: روز جمعه قابل رزرو نمی‌باشد.

source: Operation name
fa: نام عملیات

source: Operations
fa: عملیات ها

source: Operation type
fa: نوع عملیات

source: Unit of calculation
fa: واحد محاسبه

source: Number of furnaces
fa: تعداد کوره برای عملیات

source: Material volume
fa: حجم مواد

source: Is there ground melting?
fa: ذوب زمینی دارد ؟

source: Product name
fa: نام محصول

source: Melting time
fa: زمان ذوب

source: Approximate time
fa: زمان تقریبی

source: User
fa: کاربر

source: Date created
fa: تاریخ ایجاد

source: reservation date
fa: تاریخ رزرو

source: suggested reservation time
fa: ساعت پیشنهادی نوبت

source: Explanation
fa: توضیحات لازم

source: Status
fa: وضعیت

source: Reservation requests
fa: درخواست رزرو نوبت

source: Request reservation
fa: درخواست رزرو نوبت

source: fixed date
fa: تاریخ قطعی نوبت

source: From the clock
fa: از ساعت

source: Up to the hour
fa: تا ساعت

source: Appointment booking
fa: رزرو نوبت

source: Reminder of appointments
fa: یادآوری نوبت ها

source: Total number of turns:
fa: تعداد کل نوبت ها

source: Today's shifts
fa: نوبت های امروز:

source: No appointments are scheduled today.
fa: نوبتی برای امروز ثبت نشده

source: Future turns
fa: نوبت های آینده

source: No future turn recorded.
fa: نوبتی برای آینده ثبت نشده

source: Precious metals smelting workshop
fa: صنایع ذوب فلزات نجیب ترکان

source: Book your appointment now to melt precious metals in our workshop.
fa: جهت ذوب و جداسازی فلزات گرانبها خود همین حالا نوبت خود را رزرو کنید.

source: reservation
fa: رزرو نوبت

source: Please enter your suggested time to book an appointment.
fa: لطفا زمان پیشنهادی خود را جهت رزور نوبت وارد کنید.

source: Note that the time you select is not guaranteed.
fa: توجه کنید زمان تعیین شده قطعی نمی باشد.

source: reserve
fa: رزرو نوبت
